---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RoomFailures.OptionConflictBoundariesVaryMainSeparate
source: html/d37cc652-16bd-8863-5575-891738100ec2.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RoomFailures.OptionConflictBoundariesVaryMainSeparate Property

Option Conflict between Rooms.\nRoom boundary in the Main Model differs from the apparent boundary in view '[View Name]'.\nTo resolve, divide space with Room Separation Lines in the Main Model.

## Syntax (C#)
```csharp
public static FailureDefinitionId OptionConflictBoundariesVaryMainSeparate { get; }
```